{
	"@metadata": {
		"authors": [
			"Piramidion",
			"Vlad5250"
		]
	},
	"passwordlesslogin": "Вхід без пароля",
	"passwordlesslogin-desc": "Надає спосіб увійти в систему без використання пароля, шляхом підтвердження входу на приєднаному пристрої.",
	"passwordlesslogin-verify-request": "Будь ласка, верифікуйте вхід на вашому телефоні.",
	"passwordlesslogin-error-no-authentication-workflow": "Процес автентифікації неочікувано завершився.",
	"passwordlesslogin-no-challenge": "Немає активних викликів до підтвердження; будь ласка, спробуйте автентифікуватися ще раз.",
	"passwordlesslogin-verification-pending": "Автентифікацію ще не верифіковано. Будь ласка, верифікуйте свій запит на вхід на своєму приєднаному пристрої.",
	"passwordlesslogin-pair-device-step": "Будь ласка, виконайте інструкції, щоб спарувати свій новий пристрій.",
	"passwordlesslogin-no-device-paired": "Ще немає спарованого пристрою.",
	"passwordlesslogin-verify-pair": "Ми надіслали запит на вхід на ваш пристрій, аби переконатись, що його було зареєстровано правильно. Будь ласка, верифікуйте цей запит і продовжіть.",
	"passwordlesslogin-pair-device": "Спарувати пристрій для безпарольного входу",
	"passwordlesslogin-login": "Увійти за допомогою вашого смартфона",
	"passwordlesslogin-pair-step-1": "1. Завантажте застосунок MediaWiki PasswordlessLogin",
	"passwordlesslogin-pair-step-2": "2. Зіскануйте поданий QR-код за допомогою застосунка",
	"passwordlesslogin-pair-step-3": "3. Після того, як застосунок буде налаштовано, перейдіть до наступного кроку",
	"passwordlesslogin-authentication-app": "Застосунок автентифікації",
	"apihelp-passwordlesslogin-summary": "Зареєструйте новий пристрій для попередньо згенерованого токена парування.",
	"apihelp-passwordlesslogin-param-pairToken": "Попередньо згенерований токен парування для визначення того, на якого користувача має бути зареєстрований пристрій.",
	"apihelp-passwordlesslogin-param-deviceId": "Унікальний ідентифікатор пристрою, який можна використовувати як для, власне, ідентифікації пристрою, так і для надсилання сповіщень на нього за допомогою стандартної системи сповіщень пристрою (напр., Firebase Cloud Messaging для пристроїв на системі Android).",
	"apihelp-passwordlesslogin-param-secret": "Секрет, що генерується на пристрої, який буде використовуватися для підписування викликів, що надсилаються до пристрою. Цей секрет використовується для верифікації відповідей на запити на вхід у систему, і повинен зберігатися в таємниці.",
	"apihelp-passwordlesslogin-verify-challenge-summary": "Верифікувати запит на вхід, надісланий на пристрій.",
	"apihelp-passwordlesslogin-verify-challenge-param-challenge": "Виклик, який було надіслано до пристрою, і який очікує на вирішення.",
	"apihelp-passwordlesslogin-verify-challenge-param-response": "Відповідь (рішення) на виклик. Рішення має бути таким:<br />&#160;1. HMAC із SHA512 як алгоритмом підпису<br />&#160;2. Попередньо узгоджений секрет як симетричний ключовий матеріал<br />&#160;3. Дані MAC — це виклик у форматі масиву байтів<br />&#160;4. Відповідь має бути шістнадцятковим рядком<br />&#160;5. Літери у відповіді мають бути малими",
	"apihelp-passwordlesslogin-verify-login-summary": "Перевірити, чи запит на вхід уже верифіковано пристроєм."
}
